---
kind: property
id: P:Autodesk.Revit.DB.Ellipse.Normal
source: html/8f759ea5-02cc-0c21-99db-783cb91fc875.htm
---
# Autodesk.Revit.DB.Ellipse.Normal Property

Returns the normal to the plane in which the ellipse is defined.

## Syntax (C#)
```csharp
public XYZ Normal { get; }
```